
import streamlit as st
import pandas as pd

st.title("🍜 南宁美食数据仪表盘")
st.set_page_config(page_title="南宁美食数据仪表盘", page_icon="🍜", layout="wide")

data = {
   '月份': ['01月','02月','03月','04月','05月','06月','07月','08月','09月','10月','11月','12月'],
   "蛙小侠(万象城店)": [521,421,321,214,321,416,154,80,79,79,78,78],
    "海底捞(航洋城店)": [201,521,352,568,423,632,461,210,700,605,710,653],
    "塔斯汀(朝阳广场店)": [135,651,542,328,653,452,721,360,480,395,470,533],
    "螺小丰螺蛳粉(建政路店)": [754,678,654,645,345,345,456,735,562,436,486,579],
    "甘家界柠檬鸭(园湖路店)": [354,345,767,645,758,782,764,459,900,732,384,679]
    }
st.markdown("### 🍜店铺数据表")
inde= pd.Series([1,2,3,4,5,6,7,8,9,10,11,12],name='序号')
df = pd.DataFrame(data,index=inde)

#表格
st.dataframe(df)


ind = pd.Series(
    ['01月','02月','03月','04月','05月','06月','07月','08月','09月','10月','11月','12月'],
    name="月份"
)




price_trend = {
    "月份": ind,
    "蛙小侠(万象城店)": [521,421,321,214,321,416,154,80,79,79,78,78],
    "海底捞(航洋城店)": [201,521,352,568,423,632,461,210,700,605,710,653],
    "塔斯汀(朝阳广场店)": [135,651,542,328,653,452,721,360,480,395,470,533],
    "螺小丰螺蛳粉(建政路店)": [754,678,654,645,345,345,456,735,562,436,486,579],
    "甘家界柠檬鸭(园湖路店)": [354,345,767,645,758,782,764,459,900,732,384,679]
}

df_price = pd.DataFrame(price_trend).set_index("月份")


peak_data = {
    "时段(时)": [10,11,12,13,14,17,18,19,20,21,22],
    "蛙小侠(万象城店)": [120,200,350,280,150,220,400,450,380,250,180],
    "海底捞(航洋城店)": [150,220,380,300,180,250,420,480,400,280,200],
    "塔斯汀(朝阳广场店)": [200,300,450,350,200,300,500,550,480,350,250],
    "螺小丰螺蛳粉(建政路店)": [754,678,654,645,345,345,456,735,562,436,486],
    "甘家界柠檬鸭(园湖路店)": [354,345,767,645,758,782,764,459,900,732,384]
   

}
st.markdown("### 🍽️ 用餐高峰时段")

df_peak = pd.DataFrame(peak_data).set_index("时段(时)")

st.area_chart(df_peak, use_container_width=True)



shop_info = {
    "店铺名称": [
        "蛙小侠(万象城店)", "海底捞(航洋城店)", "塔斯汀(朝阳广场店)",
        "螺小丰螺蛳粉(建政路店)", "甘家界柠檬鸭(园湖路店)"
    ],
    "美食类型": ["牛蛙火锅", "川味火锅", "中式汉堡", "螺蛳粉", "柠檬鸭"], 
    "评分": [9.0, 10, 8.7, 12, 7],
    "人均价格(元)": [78, 128, 25, 18, 68],
    "latitude": [22.8068, 22.8195, 22.8170, 22.8347, 22.8400],
    "longitude": [108.3562, 108.3420, 108.3220, 108.2683, 108.2454]
}
df_shop = pd.DataFrame(shop_info).set_index("店铺名称")
st.markdown("### 🗺️ 店铺分布地图")
st.map(df_shop[["latitude", "longitude"]], zoom=12)
  
df_type_price = df_shop[["美食类型", "人均价格(元)"]].reset_index(drop=True).set_index("美食类型")

st.markdown("### ⭐ 餐厅评分")
st.bar_chart(df_shop["评分"], color="#1E90FF", use_container_width=True)


st.markdown("### 🍲 不同类型餐厅人均价格")
st.bar_chart(df_type_price["人均价格(元)"], color="#FF6B6B", use_container_width=True)

st.divider()

st.markdown("### 💰 12个月价格走势")
st.line_chart(df_price, use_container_width=True)










